In [2]:
import pandas as pd

In [3]:
file_one = "Resources/Master.csv"

In [4]:
# Read csv and put into pandas dataframe
master_df = pd.read_csv(file_one, encoding="ISO-8859-1")
master_df.head()

,playerID,coachID,hofID,firstName,lastName,nameNote,nameGiven,nameNick,height,weight,...,birthDay,birthCountry,birthState,birthCity,deathYear,deathMon,deathDay,deathCountry,deathState,deathCity
0,aaltoan01,NaN,NaN,Antti,Aalto,NaN,Antti,NaN,73.0,210.0,...,4.0,Finland,NaN,Lappeenranta,NaN,NaN,NaN,NaN,NaN,NaN
1,abbeybr01,NaN,NaN,Bruce,Abbey,NaN,Bruce,NaN,73.0,185.0,...,18.0,Canada,ON,Toronto,NaN,NaN,NaN,NaN,NaN,NaN
2,abbotge01,NaN,NaN,George,Abbott,NaN,George Henry,Preacher,67.0,153.0,...,3.0,Canada,ON,Synenham,NaN,NaN,NaN,NaN,NaN,NaN
3,abbotre01,NaN,NaN,Reg,Abbott,NaN,Reginald Stewart,NaN,71.0,164.0,...,4.0,Canada,MB,Winnipeg,NaN,NaN,NaN,NaN,NaN,NaN
4,abdelju01,NaN,NaN,Justin,Abdelkader,NaN,NaN,NaN,73.0,195.0,...,25.0,USA,MI,Muskegon,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
# Reduce columns
master_adj_df = master_df[['firstName', 'lastName', 'playerID', 'firstNHL', 'lastNHL', 'pos']]
master_adj_df.head()

  firstName    lastName   playerID  firstNHL  lastNHL pos
0     Antti       Aalto  aaltoan01    1997.0   2000.0   C
1     Bruce       Abbey  abbeybr01       NaN      NaN   D
2    George      Abbott  abbotge01    1943.0   1943.0   G
3       Reg      Abbott  abbotre01    1952.0   1952.0   C
4    Justin  Abdelkader  abdelju01    2007.0   2011.0   L

In [6]:
# Concatenated firstName and LastName columns into one Name column
master_adj_df['Name'] = master_adj_df['firstName'].str.cat(master_adj_df['lastName'],sep=" ")
master_adj_df.head()

,firstName,lastName,playerID,hofID,firstNHL,lastNHL,pos,Name
0,Antti,Aalto,aaltoan01,NaN,1997.0,2000.0,C,Antti Aalto
1,Bruce,Abbey,abbeybr01,NaN,NaN,NaN,D,Bruce Abbey
2,George,Abbott,abbotge01,NaN,1943.0,1943.0,G,George Abbott
3,Reg,Abbott,abbotre01,NaN,1952.0,1952.0,C,Reg Abbott
4,Justin,Abdelkader,abdelju01,NaN,2007.0,2011.0,L,Justin Abdelkader

In [7]:
# Reordered columns and added hofID
master_adj2_df = master_adj_df[['Name', 'firstName', 'lastName', 'playerID', 'hofID', 'firstNHL',                                'lastNHL', 'pos']]
master_adj2_df.head()

,Name,firstName,lastName,playerID,hofID,firstNHL,lastNHL,pos
0,Antti Aalto,Antti,Aalto,aaltoan01,NaN,1997.0,2000.0,C
1,Bruce Abbey,Bruce,Abbey,abbeybr01,NaN,NaN,NaN,D
2,George Abbott,George,Abbott,abbotge01,NaN,1943.0,1943.0,G
3,Reg Abbott,Reg,Abbott,abbotre01,NaN,1952.0,1952.0,C
4,Justin Abdelkader,Justin,Abdelkader,abdelju01,NaN,2007.0,2011.0,L

,Name,firstName,lastName,playerID,hofID,firstNHL,lastNHL,pos
0,Antti Aalto,Antti,Aalto,aaltoan01,NaN,1997.0,2000.0,C
1,Bruce Abbey,Bruce,Abbey,abbeybr01,NaN,NaN,NaN,D
2,George Abbott,George,Abbott,abbotge01,NaN,1943.0,1943.0,G
3,Reg Abbott,Reg,Abbott,abbotre01,NaN,1952.0,1952.0,C
4,Justin Abdelkader,Justin,Abdelkader,abdelju01,NaN,2007.0,2011.0,L

In [11]:
# Filtered out any player that did not have a firstNHL year
master_adj2_df = master_adj2_df[master_adj2_df['firstNHL'] >= 100] 
master_adj2_df.head()

,Name,firstName,lastName,playerID,hofID,firstNHL,lastNHL,pos
0,Antti Aalto,Antti,Aalto,aaltoan01,NaN,1997.0,2000.0,C
2,George Abbott,George,Abbott,abbotge01,NaN,1943.0,1943.0,G
3,Reg Abbott,Reg,Abbott,abbotre01,NaN,1952.0,1952.0,C
4,Justin Abdelkader,Justin,Abdelkader,abdelju01,NaN,2007.0,2011.0,L
5,Clarence Abel,Clarence,Abel,abelcl01,NaN,1926.0,1933.0,D

In [13]:
# Filtered out all goaltenders
master_adj2_df = master_adj2_df[master_adj2_df['pos'] != 'G'] 
master_adj2_df.head()

,Name,firstName,lastName,playerID,hofID,firstNHL,lastNHL,pos
0,Antti Aalto,Antti,Aalto,aaltoan01,NaN,1997.0,2000.0,C
3,Reg Abbott,Reg,Abbott,abbotre01,NaN,1952.0,1952.0,C
4,Justin Abdelkader,Justin,Abdelkader,abdelju01,NaN,2007.0,2011.0,L
5,Clarence Abel,Clarence,Abel,abelcl01,NaN,1926.0,1933.0,D
6,Gerry Abel,Gerry,Abel,abelge01,NaN,1966.0,1966.0,L

In [14]:
# Saved to csv
master_adj2_df.to_csv("Output/master_adj.csv", index=False, header=True, encoding='utf-8-sig')